app/views/aisles/show.html.erb

<ul>
  <% @aisle.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."aisle_id" = ?  [["aisle_id", 1]]