app/controllers/aisles_controller.rb

  def index
    @aisles = Aisle.all
---
SELECT "aisles".* FROM "aisles"

  def create
    @aisle = Aisle.new(aisle_params)

    respond_to do |format|
      if @aisle.save
---
INSERT INTO "aisles" ("name", "section", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Snacks"], ["section", "Food"], ["created_at", "2015-11-18 21:42:04.065043"], ["updated_at", "2015-11-18 21:42:04.065043"]]

    def set_aisle
      @aisle = Aisle.find(params[:id])
---
SELECT  "aisles".* FROM "aisles" WHERE "aisles"."id" = ? LIMIT 1  [["id", 1]]