app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "kind", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Cheetos"], ["kind", "Chips"], ["cost", 2], ["created_at", "2015-11-18 21:41:48.046339"], ["updated_at", "2015-11-18 21:41:48.046339"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "aisle_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["aisle_id", 2], ["updated_at", "2015-11-18 23:12:53.305621"], ["id", 1]]