app/views/products/_form.html.erb

    <%= f.label 'Aisle' %><br>
    <%= f.collection_select :aisle_id, Aisle.all, :id, :name %>
---
SELECT "aisles".* FROM "aisles"